# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [163]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import scipy.stats as sts

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

In [164]:
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [165]:
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

### Merge the DataFrames

In [166]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [167]:
#  1. Get the total rides for each city type
rides_by_type = pyber_data_df.groupby(["type"]).count()["ride_id"]

rides_by_type.head()

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [168]:
# 2. Get the total drivers for each city type
# drivers_by_type = pyber_data_df.groupby(["type"]).sum()[["driver_count"]]
drivers_by_type = city_data_df.groupby(["type"]).sum()["driver_count"]

drivers_by_type

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [169]:
#  3. Get the total amount of fares for each city type
fares_by_type = pyber_data_df.groupby(["type"]).sum()["fare"]

fares_by_type.head()

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [170]:
#  4. Get the average fare per ride for each city type.
avg_fare_per_ride = fares_by_type / rides_by_type

avg_fare_per_ride

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [171]:
# 5. Get the average fare per driver for each city type. 
avg_fare_per_driver = fares_by_type / drivers_by_type

avg_fare_per_driver

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [172]:
#  6. Create a PyBer summary DataFrame. 

pyber_summary_df = pd.DataFrame({
    "Total Rides": rides_by_type.map("{:,}".format),
    "Total Drivers": drivers_by_type.map("{:,}".format), 
    "Total Fares": fares_by_type.map("${:,.2f}".format),
    "Average Fare per Ride": avg_fare_per_ride.map("${:,.2f}".format),
    "Average Fare per Driver": avg_fare_per_driver.map("${:,.2f}".format),
})

In [173]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None

In [174]:
#  8. Format the columns.
# Formatting was performed in place in step #6 above.
# If it is better to do it separately, I will modifty the code to format in a separate cell.
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [175]:
# 1. Read the merged DataFrame
# fares_by_type = pyber_data_df.groupby(["type"]).sum()["fare"]
total_fare_by_date_df = pyber_data_df.groupby(["type", "date"]).sum()[["fare"]]
#total_fare_by_date_df = pyber_data_df.groupby(["type", "date"])["fare"]

total_fare_by_date_df

                            fare
type  date
Rural 2019-01-01 09:45:36  43.69
      2019-01-02 11:18:32  52.12
      2019-01-03 19:51:01  19.90
      2019-01-04 03:31:26  24.88
      2019-01-06 07:38:40  47.33
...                          ...
Urban 2019-05-08 04:20:00  21.99
      2019-05-08 04:39:49  18.45
      2019-05-08 07:29:01  18.55
      2019-05-08 11:38:35  19.77
      2019-05-08 13:10:18  18.04

[2375 rows x 1 columns]

In [176]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
# This seems to be the instructions for Step 1 according to the challenge
# The challenge states to use the code snippet shown in step 3 below.

In [177]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()
# This correlates with step 2 in the challenge.
total_fare_by_date_df = total_fare_by_date_df.reset_index()

total_fare_by_date_df

       type                 date   fare
0     Rural  2019-01-01 09:45:36  43.69
1     Rural  2019-01-02 11:18:32  52.12
2     Rural  2019-01-03 19:51:01  19.90
3     Rural  2019-01-04 03:31:26  24.88
4     Rural  2019-01-06 07:38:40  47.33
...     ...                  ...    ...
2370  Urban  2019-05-08 04:20:00  21.99
2371  Urban  2019-05-08 04:39:49  18.45
2372  Urban  2019-05-08 07:29:01  18.55
2373  Urban  2019-05-08 11:38:35  19.77
2374  Urban  2019-05-08 13:10:18  18.04

[2375 rows x 3 columns]

In [178]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date. 
fare_type_date_pivot = total_fare_by_date_df.pivot(index="date", columns="type", values="fare")
fare_type_date_pivot.head(10)

# Create a pivot table with the 'stoptime' as the index and the columns ='gender' with the trip counts in each row.
# gender_stoptime_pivot = gender_stoptime.pivot(index="stoptime", columns="gender", values="tripduration")
# gender_stoptime_pivot.head(10)

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
2019-01-01 09:45:36  43.69       NaN    NaN
2019-01-01 12:32:48    NaN     25.56    NaN
2019-01-01 14:40:14    NaN       NaN   5.42
2019-01-01 14:42:25    NaN       NaN  12.31
2019-01-01 14:52:06    NaN     31.15    NaN

In [179]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.
farecounts_Jan_Apr = fare_type_date_pivot.loc['2019-01-01':'2019-04-29']
farecounts_Jan_Apr

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
...                    ...       ...    ...
2019-04-28 14:28:36    NaN       NaN  11.46
2019-04-28 16:29:16    NaN       NaN  36.42
2019-04-28 17:26:52    NaN       NaN  31.43
2019-04-28 17:38:09    NaN     34.87    NaN
2019-04-28 19:35:03    NaN     16.96    NaN

[2196 rows x 3 columns]

In [180]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

In [188]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

# *** TESTING ***
# Do we need the date w/o the time?
# If so, convert to a date object using dt.date
# total_fare_by_date_df['date']= pd.to_datetime(total_fare_by_date_df['date']).dt.date

farecounts_Jan_Apr.index = pd.to_datetime(farecounts_Jan_Apr.index)

farecounts_Jan_Apr.head()

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75

In [201]:
# 7. Check that the datatype for the index is datetime using df.info()
#farecounts_Jan_Apr.index.inferred_type == "datetime64" <-- True!!
farecounts_Jan_Apr.info

<bound method DataFrame.info of type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
...                    ...       ...    ...
2019-04-28 14:28:36    NaN       NaN  11.46
2019-04-28 16:29:16    NaN       NaN  36.42
2019-04-28 17:26:52    NaN       NaN  31.43
2019-04-28 17:38:09    NaN     34.87    NaN
2019-04-28 19:35:03    NaN     16.96    NaN

[2196 rows x 3 columns]>

In [203]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.
weekly_fares_df = farecounts_Jan_Apr.resample('W').count()
weekly_fares_df

type        Rural  Suburban  Urban
date
2019-01-06      5        22     66
2019-01-13      3        35     80
2019-01-20      8        41     84
2019-01-27      6        34     84
2019-02-03      9        32     88
2019-02-10      4        31     94
2019-02-17      3        34     86
2019-02-24     11        43    103
2019-03-03      5        30     88
2019-03-10      8        33    100
2019-03-17      5        30     85
2019-03-24      5        33     96
2019-03-31      7        35     86
2019-04-07     14        38     92
2019-04-14      7        24     94
2019-04-21      8        37     91
2019-04-28      6        41     92

In [ ]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')